УТ_для_edt.РасширениеСмарт/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4f008b09-45f5-46c4-8328-e52829147381">
  <name>Проекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="24d508af-8d0e-4daf-a6d7-9b40c1eb36b3">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7d468fba-e35f-4187-8bf3-1ad16042cd5c">
    <name>ДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6ef5bce5-04ec-4290-b75b-342df3e7a74d">
    <name>ДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="30f6b359-a769-437e-975f-fa4f2e92e3fd">
    <name>Завершен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0edeaa09-7e78-498e-9c54-ce2f2a69f969">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="4b58d5ae-eed2-4e62-a1be-0eba4ff92bcd">
    <name>ПартнерыИКонтактныеЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ff79f803-60df-471d-924b-b81d7553efb1">
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="17c62a5c-9d9e-4169-8fa7-26e1f27c5163">
      <name>КонтактноеЛицо</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Проекты/ObjectModule.bsl
//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&После("ОбработкаПроверкиЗаполнения")
Процедура смарт_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// в одной группе (у одного родителя) не должно быть незавершенных проектов с одинаковым партнером
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Партнер КАК Партнер,
	|	&Родитель КАК Родитель
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ТЧ КАК ТЧ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроектыПартнерыИКонтактныеЛица.Партнер КАК Партнер,
	|	ПроектыПартнерыИКонтактныеЛица.Ссылка.Ответственный КАК Ответственный
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Проекты.ПартнерыИКонтактныеЛица КАК ПроектыПартнерыИКонтактныеЛица
	|		ПО ВТ_ТЧ.Партнер = ПроектыПартнерыИКонтактныеЛица.Партнер
	|			И ВТ_ТЧ.Родитель = ПроектыПартнерыИКонтактныеЛица.Ссылка.Родитель
	|ГДЕ
	|	НЕ ПроектыПартнерыИКонтактныеЛица.Ссылка.Завершен
	|	И НЕ ПроектыПартнерыИКонтактныеЛица.Ссылка.ПометкаУдаления
	|	И ПроектыПартнерыИКонтактныеЛица.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Родитель", 	Родитель);
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	Запрос.УстановитьПараметр("ТЧ", 		ПартнерыИКонтактныеЛица.Выгрузить());
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ТекстСообщения = "Партнер " + Выборка.Партнер + " уже защищен менеджером " + Выборка.Ответственный + ".";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,
		                                                  ЭтотОбъект,
		                                                  "ПартнерыИКонтактныеЛица",
		                                                  ,
		                                                  Отказ);
	КонецЦикла;
	
КонецПроцедуры //-- смарт:ММ 15.02.2020

//++ смарт:ММ #021 195 15.02.2020 - доработка справочника Проекты
&Вместо("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)
	
	Если ЭтоГруппа Тогда 
		// Была ошибка при вызове кода Взаимодействия.УстановитьПризнакАктивен(Ссылка, (НЕ Завершен) И (Не ПометкаУдаления));
		Возврат;
	Иначе
		ПродолжитьВызов(Отказ);
КонецЕсли;

КонецПроцедуры //-- смарт:ММ 15.02.2020
